Revit 2027 API
PlanViewRange.Unlimited Property
 View range is unlimited
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId Unlimited { get; }
Public Shared ReadOnly Property Unlimited As ElementId
	Get
public:
static property ElementId^ Unlimited {
	ElementId^ get ();
}
static member Unlimited : ElementId with get
Property Value
ElementId
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace